AutB_MOD_10_Motion_Control_With_PLCopen/README.md
```mermaid
---
title: Partial Motion Control State Diagram
---

stateDiagram-v2

[*] --> Disabled : No Error and no MC_Power
[*] --> ErrorStop : Error

ErrorStop --> Standstill : MC_Reset and No Error
ErrorStop --> Disabled
Disabled --> Standstill : MC_Power
Standstill --> Homing
Stopping --> Standstill : Done
Standstill --> DiscreteMotion
Standstill --> SynchronizedMotion
Standstill --> ContinuousMotion

Homing --> Standstill : Done
Homing --> Stopping : Stop

DiscreteMotion --> Stopping : Stop
DiscreteMotion --> Standstill : Done
SynchronizedMotion --> Stopping : Stop
ContinuousMotion --> Stopping : Stop

```
